"""
 1. За допомогою циклу for вивести всі значення з ліста і помножити на 4.
    Скрипт має вивести такий результат:
    180
    300
    4
    8
    32
    2568
    40
    248
    172
    128.84
    0.6
    380
    252.496
    312

    Об'єкт з даними:
    list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 32.21, 0.15, 95, 63.124, 78]
"""
# list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 32.21, 0.15, 95, 63.124, 78]
# for i in list_data:
#     print(i * 4)

"""
2*. Перевірити всі значення з ліста і якщо цифра знаходиться в проміжку між 9 і 79, то виводити ці цифри, якщо ні, 
   то пропускати.
   Скрипт має вивести такий ряд чисел:
            45
            75
            10
            62
            43
            32
            21
            78
   Об'єкт з даними:
    list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 32, 21, 0.15, 95, 63.124, 78]
"""
# list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 32, 21, 0.15, 95, 63.124, 78]
# for i in list_data:
#     if i in range(9, 80):
#         print(i)
#     else:
#         continue

"""
3. Написати скрипт, який перевірятиме цифри з ліста і якщо число ділитиметься без остачі, то його потрібно буде 
   множити на 3, інакше - число пропускати. Якщо буде число 0, то виводити повідомлення 
   "ValueError: cannot be divided by zero"
   Для прикладу: число 48 / 2 = 24 ціле і залишку нема, якщо 47 / 2 = 23.5, 
   в якому 0.5 - залишок - такі числа потрібно пропускати.

3.1.** Виконати це завдання за допомогою while 

   Скрипт має вивести такий ряд чисел:
    6
    24
    1926
    30
    186
    240
    96
    234
    1956
    600
    1350
    ValueError: cannot be divided by zero

   Об'єкт з даними:
    list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 80, 32, 21, 0.15, 95, 63.124, 78, 1523, 652, 200, 450, 0]
"""
list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 80, 32, 21, 95, 63.124, 78, 1523, 652, 200, 450, 0]
for i in list_data:
    if i == 0:
        print("ValueError: cannot be divided by zero")
    elif i % 2 == 0:
        print(i * 3)
    else:
        continue

list_data = [45, 75, 1, 2, 8, 642, 10, 62, 43, 80, 32, 21, 95, 63.124, 78, 1523, 652, 200, 450, 0]
while len(list_data) > 0:
    pop_element = list_data.pop(0)
    if pop_element == 0:
        print("ValueError: cannot be divided by zero")
        continue
    if pop_element % 2 == 0:
        print(pop_element * 3)
    else:
        continue

"""
    4. Написати скрипт, який співставить кожну букву слова відповідній його індексу.
    Скрипт має вивести такий результат:
    U -> 0
    k -> 1
    r -> 2
    a -> 3
    i -> 4
    n -> 5
    e -> 6

    Слово для перебору буде введено юзером:
    word = input("Enter your word: ")

"""

country = 'Ukraine'
for word in country:
    index_elemet = country.index(word)
    print(word, index_elemet, sep=' -> ')
