"""
    1. Написати функцію, яка прийме на вхід параметри прізвища, імені та побатькові, а також
    рік народження і якщо якийсь із параметрів не буде передано, то функція поверне стандартний параметр,
    котрий має бути в функції.

    Приклад, до функції передано лише прізвище та ім'я без по батькові та року народження, або лише прізвище без
    ім'я, по батькові та року народження, але повертатимуться дані з усіх параметрів
"""

"""
    2. Зробити так аби можна було перемінну "parameter" можна було викликати поза функцією.
    Приклад функції нище:
        def pi_integer():
        parameter = 3.14
        return parameter
"""


"""
    3**. Дописати функцію таким чином, щоб приймаючи на вхід параметри - повертався дікт.
    Функція, яку треба дописати:
    
    def func_args(*args):
        pass
        
    print(func_args('Testsurname', 'Testname', 'test@mail.com'))
    
    В результаті те що має повернутися:
    {'first_name': 'Testsurname', 'second_surname': 'Testname', 'third_email': 'test@mail.com'}
"""


def func_args(*args):
    first, second, third = '', '', ''
    first, second, third = args
    pass


print(func_args('Testsurname', 'Testname', 'test@mail.com'))
