"""
    1. Написати скрипт, який переберитиме вкладений ліст з лістами, та запаковуватиме в один ліст.

    Скрипт після виконання має вивести такий результат:
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21]

    Приклад з лістом:
    integer_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12], [13, 14, 15], [16, 17, 18], [19, 20, 21]]

"""


"""
    2. Написати скрипт, який визначить найдовше речення з ліста.    
    
    
    Приклад ліста, який потрібно перевірити: 
    facts = [
    ["Планета Земля єдина планета, на якій відоме життя."],
    ["Сонце найбільший об'єкт у Сонячній системі."],
    ["Джордж Вашингтон перший президент США."],
    ["Кількість годин в добі дорівнює 24."],
    ["День Незалежності України 24 серпня."],
]
"""


"""
    3**. Написати скрипт, який відсортує голосні від приголосних і порахує кожну групу букв.
    
    Після виконання скрипта має бути такий результат:
    "Кількість голосних літер - 6, приголосних - 20"
    
    
    Приклад ліста з алфавітом:
    alphabet = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm',
            'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']


"""


"""
    4**. Написати скрипт, який виведе кількість голосних і приголосних слів у власному імені. Наприклад,
       юзер вводить ім'я "Ivan", скрипт виводить результат:
       'Кількість голосних літер - 2, приголосних - 2'

"""

