# 1
"""
    Напишіть програму, яка виводить числа від 1 до 10.

    for i in range(1, 11):
        print(i)

"""

# 2
"""
    Напишіть програму, яка виводить непарні числа від 1 до 20.
    for i in range(1, 21):
        if i % 2 != 0:
            print(i)
"""

# 3
"""
    Напишіть програму, яка виводить квадрати чисел від 1 до 10.
    for i in range(1, 11):
        print(i ** 2)
"""

# 4
"""
    Напишіть програму, яка виводить суму чисел від 1 до 10.
    sum = 0
    for i in range(1, 11):
        sum += i
    print(sum)
"""


# 5
"""
    Напишіть програму, яка виводить фактори числа 12.
    factors = []
    for i in range(1, 13):
        if 12 % i == 0:
            factors.append(i)
    print(factors)
"""

# 6
"""
    Напишіть програму, яка виводить всі парні числа від 2 до 100.
    for i in range(2, 101):
        if i % 2 == 0:
            print(i)
"""

# 7
"""
    Напишіть програму, яка виводить всі числа від 1 до 100, які діляться на 3 або на 5.
    for i in range(1, 101):
        if i % 3 == 0 or i % 5 == 0:
            print(i)
"""




# 8
"""
    Напишіть програму, яка виводить всі числа від 1 до 100, які не діляться ні на 3, ні на 5.
    for i in range(1, 101):
        if i % 3 != 0 and i % 5 != 0:
            print(i)
"""
